{
  "projects": [
    {
      "id": "solana-sdk",
      "title": "Solana SDK",
      "description": "A lightweight TypeScript SDK for Solana—simplifying wallet connections, transaction signing, and SPL token interactions.",
      "link": "https://www.npmjs.com/package/@elisedd/solana-sdk",
      "tags": ["TypeScript", "Solana", "Blockchain"],
      "type": "external",
      "content": [
        {
          "type": "text-only",
          "text": [
            "A lightweight TypeScript SDK designed to simplify Solana blockchain interactions.",
            "Features include: wallet connection management, transaction signing, SPL token operations, and reduced boilerplate code for DApp development.",
            "Published on npm and actively maintained with focus on developer experience and reliability."
          ]
        }
      ]
    },
    {
      "id": "solana-dapp",
      "title": "Solana DApp",
      "description": "A TypeScript web app that demonstrates how to interact with the Solana blockchain directly from the browser.",
      "link": "https://github.com/selimann/solanawallet",
      "tags": ["Solana", "TypeScript", "UI"],
      "type": "external",
      "content": [
        {
          "type": "text-only",
          "text": [
            "A demonstration TypeScript web application showcasing direct Solana blockchain interactions in the browser.",
            "Implements wallet integration, token transfers, and transaction history display.",
            "Serves as both a functional DApp and educational resource for Solana development."
          ]
        }
      ]
    },
    {
      "id": "x402-payment-gateway",
      "title": "x402 Payment Gateway",
      "description": "A secure Node.js server implementing the x402 protocol for USDC micropayments on Base Sepolia, with automated testnet token distribution.",
      "link": "https://github.com/selimann/x402",
      "tags": [
        "Node.js",
        "TypeScript",
        "x402",
        "USDC",
        "Base Sepolia",
        "Blockchain"
      ],
      "type": "external",
      "content": [
        {
          "type": "text-only",
          "text": [
            "A production-ready payment gateway that implements the x402 (HTTP 402 Payment Required) protocol using USDC on Base Sepolia testnet.",
            "Features a robust Express middleware that verifies on-chain USDC transfers in real time, protects premium API routes, and returns detailed payment proofs.",
            "Includes a standalone airdrop automation script that claims 0.01 USDC test tokens from Circle's faucet with retry logic, error handling, and balance verification.",
            "Built with TypeScript, ethers.js, and native Node.js fetch — zero external HTTP dependencies, full type safety, and modular design."
          ]
        }
      ]
    }
  ]
}
